Brand-Frank/STM32-ALK8266/M8266WIFI/brd_cfg.h
/********************************************************************
 * brd_cfg.h	（SPI和IO管脚接线用法）
 * .Description
 *     header file of main board configuration macros 
 ********************************************************************/
#ifndef _BRG_CFG_H_
#define _BRG_CFG_H_

#define MCU_IS_STM32F1XX
//#define MCU_IS_STM32F2XX
//#define MCU_IS_STM32F3XX
//#define MCU_IS_STM32F4XX
//#define MCU_IS_STM32F7XX
//#define MCU_IS_STM32L1XX
//#define MCU_IS_STM32L4XX
//#define MCU_IS_STM32H7XX

//#define MCU_IS_NXP_LPC17XX
//#define MCU_IS_NXP_MK27_28

//#define MCU_IS_HT32F16XX

#if defined(MCU_IS_HT32F16XX)
#include "ht32f1655_56.h"
#endif

//#define USE_LED_AND_KEY_FOR_TEST

//----------------------------------------------------------------------------------
// M8266WIFI Module Interface Board Usages Macros
//      -- nRESET, nCS
//----------------------------------------------------------------------------------

/*	nRESET	*/
#if defined(MCU_IS_STM32F1XX)  // STM's STM32F1XX, using *GPIOB12* as nRESET
	#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE)//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE)
	#define  M8266WIFI_nRESET_GPIO					GPIOA//GPIOB
	#define  M8266WIFI_nRESET_PIN					GPIO_Pin_1//GPIO_Pin_12

#elif defined(MCU_IS_STM32F2XX)  // STM's STM32F2XX, //using *GPIOD0* as nRESET
	#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE)
	#define  M8266WIFI_nRESET_GPIO					GPIOD
	#define  M8266WIFI_nRESET_PIN					GPIO_Pin_0

#elif defined(MCU_IS_STM32F3XX)  // STM's STM32F3XX, //using *GPIOC9* as nRESET
	#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE)
	#define  M8266WIFI_nRESET_GPIO					GPIOC
	#define  M8266WIFI_nRESET_PIN					GPIO_Pin_9

#elif defined(MCU_IS_STM32F4XX)  // STM's STM32F4XX, 
//using *GPIOD13* as nRESET
//#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE)
//#define  M8266WIFI_nRESET_GPIO											GPIOD
//#define  M8266WIFI_nRESET_PIN												GPIO_Pin_13
//using *GPIOB9* as nRESET
#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE)
#define  M8266WIFI_nRESET_GPIO											GPIOB
#define  M8266WIFI_nRESET_PIN												GPIO_Pin_9
//using *GPIOA0* as nRESET
//#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
//#define  M8266WIFI_nRESET_GPIO											GPIOA
//#define  M8266WIFI_nRESET_PIN												GPIO_Pin_0
//using *GPIOE4* as nRESET
//#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE)
//#define  M8266WIFI_nRESET_GPIO											GPIOE
//#define  M8266WIFI_nRESET_PIN												GPIO_Pin_4

#elif defined(MCU_IS_STM32F7XX)  // STM's STM32F7XX, using *GPIOB2* as nRESET  // avoid to use PE3, boards like Apollo have problems in output high simutenous to nearby PIO e.g. PE3&PE4
#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  __HAL_RCC_GPIOE_CLK_ENABLE()
#define  M8266WIFI_nRESET_GPIO											GPIOE
#define  M8266WIFI_nRESET_PIN												GPIO_PIN_3
//#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  __HAL_RCC_GPIOB_CLK_ENABLE()
//#define  M8266WIFI_nRESET_GPIO											GPIOB
//#define  M8266WIFI_nRESET_PIN												GPIO_PIN_2

#elif defined(MCU_IS_STM32L1XX)  // STM's STM32L1XX, using *GPIOC3* as nRESET
#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  __HAL_RCC_GPIOC_CLK_ENABLE()
#define  M8266WIFI_nRESET_GPIO											GPIOC
#define  M8266WIFI_nRESET_PIN												GPIO_PIN_3

#elif defined(MCU_IS_STM32L4XX)  // STM's STM32L4XX, using *GPIOC3* as nRESET
#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  __HAL_RCC_GPIOC_CLK_ENABLE()
#define  M8266WIFI_nRESET_GPIO											GPIOC
#define  M8266WIFI_nRESET_PIN												GPIO_PIN_3

#elif defined(MCU_IS_STM32H7XX)  // STM's STM32H7XX, using *GPIOE3* as nRESET
#define  M8266WIFI_nRESET_GPIO_RCC_CLOCK_EN				  __HAL_RCC_GPIOE_CLK_ENABLE()
#define  M8266WIFI_nRESET_GPIO											GPIOE
#define  M8266WIFI_nRESET_PIN												GPIO_PIN_3

#elif defined(MCU_IS_NXP_LPC17XX) // NXP's LPC17XX,  using *GPIO[2,7]* as nRESET
#define  M8266WIFI_nRESET_GPIO											LPC_GPIO2
#define  M8266WIFI_nRESET_PIN												7

#elif defined(MCU_IS_NXP_MK27_28)   	// NXP's MK27/MK28, using *PTE4* as nRESET
#define  M8266WIFI_nRESET_PORT											PORTE
#define  M8266WIFI_nRESET_PORT_CLOCK								kCLOCK_PortE
#define  M8266WIFI_nRESET_GPIO											GPIOE
#define  M8266WIFI_nRESET_PIN												4

#elif defined(MCU_IS_HT32F16XX)   // Holtek's HT32F16XX, using *GPIOA2* as nRESET
#define  M8266WIFI_nRESET_GPIO_CLK_BIT		CKCUClock.Bit.PA
#define  M8266WIFI_nRESET_GPIO				HT_GPIOA
#define  M8266WIFI_nRESET_PIN				GPIO_PIN_2

#else
	#error YOU SHOULD DEFINED MCU_IS_XXX near line 17 in brd_cfg.h
#endif

/*	nCS		*/ 
#if defined(MCU_IS_STM32F1XX)  // STM's STM32F1XX, using *GPIOA4* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE)
	#define  M8266WIFI_SPI_nCS_GPIO								GPIOA
	#define  M8266WIFI_SPI_nCS_PIN								GPIO_Pin_4

#elif defined(MCU_IS_STM32F2XX)  // STM's STM32F2XX, // using *GPIOA15* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOA
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_Pin_15

#elif defined(MCU_IS_STM32F3XX)  // STM's STM32F3XX, // using *GPIOC8* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE)
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOC
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_Pin_8

#elif defined(MCU_IS_STM32F4XX)  // STM's STM32F4XX
//using *GPIOA8* as nCS
	//#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
	//#define  M8266WIFI_SPI_nCS_GPIO											GPIOA
	//#define  M8266WIFI_SPI_nCS_PIN											GPIO_Pin_8
//using *GPIOD3* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE)
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOD
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_Pin_3
//using *GPIOA4* as nCS
	//#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN		  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE)
	//#define  M8266WIFI_SPI_nCS_GPIO										GPIOA
	//#define  M8266WIFI_SPI_nCS_PIN										GPIO_Pin_4
//using *GPIOE6* as nCS
	//#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN			RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE)
	//#define  M8266WIFI_SPI_nCS_GPIO										GPIOE
	//#define  M8266WIFI_SPI_nCS_PIN										GPIO_Pin_6

#elif defined(MCU_IS_STM32F7XX)  // STM's STM32F7XX, using *GPIOE4* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				__HAL_RCC_GPIOE_CLK_ENABLE()
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOE
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_PIN_4

#elif defined(MCU_IS_STM32L1XX)  // STM's STM32L1XX, using *GPIOC2* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				__HAL_RCC_GPIOC_CLK_ENABLE()
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOC
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_PIN_2 

#elif defined(MCU_IS_STM32L4XX)  // STM's STM32L4XX, using *GPIOC2* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				__HAL_RCC_GPIOC_CLK_ENABLE()
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOC
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_PIN_2 

#elif defined(MCU_IS_STM32H7XX)  // STM's STM32H7XX, using *GPIOE4* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_RCC_CLOCK_EN				__HAL_RCC_GPIOE_CLK_ENABLE()
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOE
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_PIN_4 

#elif defined(MCU_IS_NXP_LPC17XX) // NXP's LPC17XX, using *GPIO[0,16]* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO											LPC_GPIO0
	#define  M8266WIFI_SPI_nCS_PIN											16

#elif defined(MCU_IS_NXP_MK27_28)   	// NXP's MK27/MK28, using *PTD15* as nCS
	#define  M8266WIFI_SPI_nCS_PORT											PORTD
	#define  M8266WIFI_SPI_nCS_PORT_CLOCK								kCLOCK_PortD
	#define  M8266WIFI_SPI_nCS_GPIO											GPIOD
	#define  M8266WIFI_SPI_nCS_PIN											15

#elif defined(MCU_IS_HT32F16XX)   // Holtek's HT32F16XX, using *GPIOA3* as nCS
	#define  M8266WIFI_SPI_nCS_GPIO_CLK_BIT							CKCUClock.Bit.PA
	#define  M8266WIFI_SPI_nCS_GPIO											HT_GPIOA
	#define  M8266WIFI_SPI_nCS_PIN											GPIO_PIN_3

#else
	#error YOU SHOULD DEFINED MCU_IS_XXX near line 17 in brd_cfg.h
#endif


//----------------------------------------------------------------------------------
// M8266WIFI Module Interface Board Usages Macros
//     - MOSI - MISO - CLK
//----------------------------------------------------------------------------------

